Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТЧВыплаты = Выплаты.Выгрузить();
	
	Для Каждого Строка Из ТЧВыплаты Цикл
		
		ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
        ДвижениеВзаиморасчеты.Период = Дата;
        ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Расход;
        ДвижениеВзаиморасчеты.Регистратор = Ссылка; // или используйте документ-основание, если есть
        ДвижениеВзаиморасчеты.Сотрудник = Строка.Сотрудник;
        ДвижениеВзаиморасчеты.Сумма = Строка.Сумма;
		
	КонецЦикла;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
КонецПроцедуры
