#language: ru

@tree

Функционал: <3.	Массовое создание актов от имени Бухгалтера>

Как <БухгалтерИТФирмы> я хочу
<массово создать акты по заказам> 
чтобы <не делать данную работу в ручную> 

Сценарий: <>
И В командном интерфейсе я выбираю "Обслуживание Клиентов" "Массовое создание актов"
Тогда открылось окно "Массовое создание актов"
И я нажимаю кнопку выбора у поля с именем 'Период'
И в поле с именем 'Период' я ввожу текст "30.09.2025"
И я нажимаю на кнопку с именем 'ФормаСоздаттьРеализацию'
И В командном интерфейсе я выбираю "Обслуживание Клиентов" "Реализации товаров и услуг"







