
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ВКМ_ВыставленныеАктыКлиенту.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
	КонецЦикла;
	
	//{{SofronovaN: Движение по регистру выставленные акты клиенту
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.ВКМ_ВыставленныеАктыКлиенту.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Контрагент;
		Движение.Договор = Договор;
		Движение.ОписаниеРабот = ТекСтрокаУслуги.Номенклатура;
		Движение.СуммаВыставленныхАктов = ТекСтрокаУслуги.Сумма;
	КонецЦикла;	
		//{{
	
 
 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

// {{Sofronova NV: процедура автозаполнения ТЧ Услуги

Процедура ВыполнитьАвтозаполнение() Экспорт

    // Получаем номенклатуру из констант
    НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
    НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();

//получаем номенклатуру из констант НоменклатураАбонентскаяПлата и НоменклатураРаботыСпециалиста, 
//если хотя бы одна не заполнена, необходимо выдать ошибку и прекратить выполнение процедуры
    Если  НоменклатураАбонентскаяПлата.Пустая() ИЛИ НоменклатураРаботыСпециалиста.Пустая() Тогда
        //@skip-check use-non-recommended-method
        Сообщить("Необходимо заполнить константы НоменклатураАбонентскаяПлата и НоменклатураРаботыСпециалиста!");
        Возврат;
    КонецЕсли;

    // Очищаем табличную часть
    Услуги.Очистить();

    // Если в договоре ненулевая сумма абонентской платы, 
    //добавляем в табличную часть строку с номенклатурой из константы НоменклатураАбонентскаяПлата
    // и суммой абонентской платы из договора
    //@skip-check reading-attribute-from-database
    СуммаДоговора = Договор.ВКМ_СуммаЕжемесячнойАбонентскойПлаты;
    ТЧУслуги = Услуги.Выгрузить();
    Если СуммаДоговора > 0 Тогда
    	НайденаАбонентскаяПлата = Ложь;

    Для Каждого СтрокаТЧ из ТЧУслуги Цикл
        Если СтрокаТЧ.Номенклатура = НоменклатураАбонентскаяПлата Тогда
            НайденаАбонентскаяПлата = Истина;
            Прервать; // Больше искать не нужно, если нашли
        КонецЕсли;
    КонецЦикла;
    
    	Если Не НайденаАбонентскаяПлата Тогда
        НоваяСтрока = Услуги.Добавить();
        НоваяСтрока.Номенклатура = НоменклатураАбонентскаяПлата;
        НоваяСтрока.Количество = 1; // Предполагаем, что это одна услуга
        НоваяСтрока.Цена = СуммаДоговора;
        НоваяСтрока.Сумма = СуммаДоговора;
    КонецЕсли;  
    КонецЕсли;

    // Если в месяц даты документа в регистре ВыполненныеКлиентуРаботы есть информация 
    //о выполненных работах по этому договору, добавляем в табличную часть строку с номенклатурой 
    //из константы НоменклатураРаботыСпециалиста и общим количеством и суммой из 
    //регистра ВыполненныеКлиентуРаботы за месяц документа
    ДатаНачалаМесяца = НачалоМесяца(Дата);
    ДатаКонцаМесяца = КонецМесяца(Дата);

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |	СУММА(ВКМ_ВыполненныеКлиентуРаботы.СуммаКОплате) КАК Сумма,
        |	СУММА(ВКМ_ВыполненныеКлиентуРаботы.КоличествоЧасов) КАК Количество,
        |	ВКМ_ВыполненныеКлиентуРаботы.ПоЗаказуВыставленаРеализация,
        |	ВКМ_ВыполненныеКлиентуРаботы.Регистратор
        |ИЗ
        |	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
        |ГДЕ
        |	ВКМ_ВыполненныеКлиентуРаботы.Договор = &Договор
        |	И ВКМ_ВыполненныеКлиентуРаботы.Период МЕЖДУ &ДатаНачалаМесяца И &ДатаКонцаМесяца
        |СГРУППИРОВАТЬ ПО
        |	ВКМ_ВыполненныеКлиентуРаботы.ПоЗаказуВыставленаРеализация,
        |	ВКМ_ВыполненныеКлиентуРаботы.Регистратор";

    Запрос.УстановитьПараметр("Договор", Договор);
    Запрос.УстановитьПараметр("ДатаНачалаМесяца", ДатаНачалаМесяца);
    Запрос.УстановитьПараметр("ДатаКонцаМесяца", ДатаКонцаМесяца);

    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    
    Пока  Выборка.Следующий() Цикл

        ОбщееКоличество = Выборка.Количество;
        ОбщаяСумма = Выборка.Сумма;
        
        Если ОбщееКоличество = Null Тогда
        	ОбщееКоличество = 0
        КонецЕсли;

       Если ОбщееКоличество >0 И Выборка.ПоЗаказуВыставленаРеализация = Ложь Тогда  // Проверяем, что есть работы в регистре
            НоваяСтрока = Услуги.Добавить();
            НоваяСтрока.Номенклатура = НоменклатураРаботыСпециалиста;
            НоваяСтрока.Количество = ОбщееКоличество;
            НоваяСтрока.Сумма = ОбщаяСумма;
            НоваяСтрока.Цена = Окр(ОбщаяСумма / ОбщееКоличество, 2); // Вычисляем цену (с округлением)
        СуммаДокумента = ОбщаяСумма;
        
        ДокументОбслуживаниеКлиентов = Документы.ВКМ_ОбслуживаниеКлиента.НайтиПоНомеру(Выборка.Регистратор.Номер);
        ДокументОбслуживаниеКлиентов = ДокументОбслуживаниеКлиентов.ПолучитьОбъект();
        ДокументОбслуживаниеКлиентов.ПоЗаказуВыставленаРеализация = Истина;
        ДокументОбслуживаниеКлиентов.Записать();
       Иначе
        Продолжить
        КонецЕсли;
      
    КонецЦикла;
   //@skip-check module-self-reference
   ЭтотОбъект.Записать(); 
     
КонецПроцедуры

//}}

#КонецОбласти

#КонецЕсли
