
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

Процедура ВыполнитьАвтозаполнение() Экспорт

    // Получаем номенклатуру из констант
    НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
    НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();

    Если  НоменклатураАбонентскаяПлата.Пустая() ИЛИ НоменклатураРаботыСпециалиста.Пустая() Тогда
        Сообщить("Необходимо заполнить константы НоменклатураАбонентскаяПлата и НоменклатураРаботыСпециалиста!");
        Возврат;
    КонецЕсли;

    // Очищаем табличную часть
    Услуги.Очистить();

    // Добавляем строку с абонентской платой
    Если СуммаДокумента > 0 Тогда
        НоваяСтрока = ЭтотОбъект.Услуги.Добавить();
        НоваяСтрока.Номенклатура = НоменклатураАбонентскаяПлата;
        НоваяСтрока.Количество = 1; // Предполагаем, что это одна услуга
        НоваяСтрока.Цена = СуммаДокумента;
        НоваяСтрока.Сумма = СуммаДокумента;
      
    КонецЕсли;

    // Добавляем строки из регистра ВыполненныеКлиентуРаботы
    ДатаНачалаМесяца = НачалоМесяца(Дата);
    ДатаКонцаМесяца = КонецМесяца(Дата);

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |	СУММА(ВКМ_ВыполненныеКлиентуРаботы.СуммаКОплате) КАК Сумма,
        |	СУММА(ВКМ_ВыполненныеКлиентуРаботы.КоличествоЧасов) КАК Количество
        |ИЗ
        |	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
        |ГДЕ
        |	ВКМ_ВыполненныеКлиентуРаботы.Договор = &Договор
        |	И ВКМ_ВыполненныеКлиентуРаботы.Период МЕЖДУ &ДатаНачалаМесяца И &ДатаКонцаМесяца";

    Запрос.УстановитьПараметр("Договор", Договор);
    Запрос.УстановитьПараметр("ДатаНачалаМесяца", ДатаНачалаМесяца);
    Запрос.УстановитьПараметр("ДатаКонцаМесяца", ДатаКонцаМесяца);

    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    
    Пока  Выборка.Следующий() Цикл

        ОбщееКоличество = Выборка.Количество;
        ОбщаяСумма = Выборка.Сумма;

        Если ОбщееКоличество > 0 Тогда  // Проверяем, что есть работы в регистре
            НоваяСтрока = ЭтотОбъект.Услуги.Добавить();
            НоваяСтрока.Номенклатура = НоменклатураРаботыСпециалиста;
            НоваяСтрока.Количество = ОбщееКоличество;
            НоваяСтрока.Сумма = ОбщаяСумма;
            НоваяСтрока.Цена = Окр(ОбщаяСумма / ОбщееКоличество, 2); // Вычисляем цену (с округлением)
        КонецЕсли;
    КонецЦикла;
   // ЭтотОбъект.Записать(); 
     
КонецПроцедуры

#КонецОбласти

#КонецЕсли
