&НаКлиенте
Перем АдресОтпусковВХранилище, ГодОтпусков;

&НаКлиенте
Процедура АнализГрафикаОтпусков(Команда)

    // Получаем адрес временного хранилища
    АдресОтпусковВХранилище = ПоместитьСотрудниковВХранилище();
    ГодОтпусков = Объект.Год;

    // Параметры для открытия формы
    ПараметрыФормы = Новый Структура("АдресОтпусков, ГодОтпусков", АдресОтпусковВХранилище, ГодОтпусков);

    // Открываем форму
    ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаСервере
Функция ПоместитьСотрудниковВХранилище()

    // Выгружаем табличную часть "ОтпускаСотрудников" в таблицу значений
    ТаблицаОтпусков = Объект.ОтпускаСотрудников.Выгрузить();

    // Помещаем таблицу значений во временное хранилище и возвращаем адрес
    Возврат ПоместитьВоВременноеХранилище(ТаблицаОтпусков, Новый УникальныйИдентификатор());

КонецФункции

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент, ОформлениеСтроки, ДанныеСтроки)
	

    //Получаем табличную часть документа
    ТекущиеДанныеТаблицы = Объект.ОтпускаСотрудников;

    Если ТекущиеДанныеТаблицы = Неопределено Тогда
        Возврат;
    КонецЕсли;

    //Используем соответствие для хранения дней отпуска по сотрудникам
    ОтпускаСотрудников = Новый Соответствие;

    Для Каждого Строка Из ТекущиеДанныеТаблицы Цикл

       
        //Проверяем заполненность данных
        Если ЗначениеЗаполнено(Строка.ДатаНачала) И ЗначениеЗаполнено(Строка.ДатаОкончания) И ЗначениеЗаполнено(Строка.Сотрудник) Тогда

            //Рассчитываем количество дней отпуска + 1 день (включительно)
            ДнейОтпуска = (НачалоДня(Строка.ДатаОкончания) - НачалоДня(Строка.ДатаНачала)) / 86400 + 1;

            //Если сотрудника еще нет в соответствие, добавляем его с 0 дней, иначе прибавляем к существующему значению.
            Если ОтпускаСотрудников.Получить(Строка.Сотрудник) = Неопределено Тогда
                ОтпускаСотрудников.Вставить(Строка.Сотрудник, ДнейОтпуска);
            Иначе
                ОтпускаСотрудников[Строка.Сотрудник] = ОтпускаСотрудников[Строка.Сотрудник] + ДнейОтпуска;
            КонецЕсли;
            
            //Проверяем превышение лимита дней
             Если ОтпускаСотрудников[Строка.Сотрудник] > 28 Тогда
               // Сообщить("У сотрудника " + Строка.Сотрудник + " отпуск превышает 28 дней: " + ОтпускаСотрудников[Строка.Сотрудник]);
             Строка.Больше28дней = Истина;
             Иначе
             	Строка.Больше28дней = Ложь;
             КонецЕсли;
        КонецЕсли; // ЗначениеЗаполнено

    КонецЦикла;
	
КонецПроцедуры



&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	
	
    //Получаем табличную часть документа
    ТекущиеДанныеТаблицы = Объект.ОтпускаСотрудников;

    Если ТекущиеДанныеТаблицы = Неопределено Тогда
        Возврат;
    КонецЕсли;

    //Используем соответствие для хранения дней отпуска по сотрудникам
    ОтпускаСотрудников = Новый Соответствие;

    Для Каждого Строка Из ТекущиеДанныеТаблицы Цикл

       
        //Проверяем заполненность данных
        Если ЗначениеЗаполнено(Строка.ДатаНачала) И ЗначениеЗаполнено(Строка.ДатаОкончания) И ЗначениеЗаполнено(Строка.Сотрудник) Тогда

            //Рассчитываем количество дней отпуска + 1 день (включительно)
            ДнейОтпуска = (НачалоДня(Строка.ДатаОкончания) - НачалоДня(Строка.ДатаНачала)) / 86400 + 1;

            //Если сотрудника еще нет в соответствие, добавляем его с 0 дней, иначе прибавляем к существующему значению.
            Если ОтпускаСотрудников.Получить(Строка.Сотрудник) = Неопределено Тогда
                ОтпускаСотрудников.Вставить(Строка.Сотрудник, ДнейОтпуска);
            Иначе
                ОтпускаСотрудников[Строка.Сотрудник] = ОтпускаСотрудников[Строка.Сотрудник] + ДнейОтпуска;
            КонецЕсли;
            
            //Проверяем превышение лимита дней
             Если ОтпускаСотрудников[Строка.Сотрудник] > 28 Тогда
               // Сообщить("У сотрудника " + Строка.Сотрудник + " отпуск превышает 28 дней: " + ОтпускаСотрудников[Строка.Сотрудник]);
             Строка.Больше28дней = Истина;
             Иначе
             	Строка.Больше28дней = Ложь;
             КонецЕсли;
        КонецЕсли; // ЗначениеЗаполнено

    КонецЦикла;
	
КонецПроцедуры
