Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    СформироватьДвиженияДополнительныеНачисления();

    Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();

КонецПроцедуры

Процедура СформироватьДвиженияДополнительныеНачисления()

НДФЛ = 0.13;

    Для Каждого СтрокаТЧ Из СписокСотрудников Цикл

        Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
        Движение.ПериодРегистрации = Дата; // Используем дату документа
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия; // Получаем ссылку на предопределенный вид расчета
        Движение.Сотрудник = СтрокаТЧ.Сотрудник;
        Движение.Сумма= СтрокаТЧ.СуммаПремии; // Сумма из табличной части
        
        НовоеДвижениеУдержания  = Движения.ВКМ_Удержания.Добавить();
        НовоеДвижениеУдержания.ПериодРегистрации  = Движение.ПериодРегистрации;
        НовоеДвижениеУдержания.Сотрудник  = Движение.Сотрудник;
        НовоеДвижениеУдержания.ВидРасчета  = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
        НовоеДвижениеУдержания.Сумма        =  Движение.Сумма*НДФЛ; 
        
	КонецЦикла; 
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();

КонецПроцедуры

