#Область ОписаниеПеременных
&НаКлиенте
Перем АдресОтпусковВХранилище, ГодОтпусков;


//@skip-check module-unused-method
&НаСервере
Процедура ЗаписатьПодборВХранилище()

    ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(), АдресОтпусков);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПодбор() Экспорт

    ПолучитьОтпускаИзХранилища(АдресОтпусков);
    Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ПолучитьОтпускаИзХранилища(АдресОтпусковВХранилище)

    Объект.ОтпускаСотрудников.Загрузить(ПолучитьИзВременногоХранилища(АдресОтпусковВХранилище));

КонецПроцедуры

//@skip-check bsl-variable-name-invalid
&НаСервереБезКонтекста
Процедура АнализГрафикаОтпусков(ДГ,ТаблицаОтпусков, ГодОтпуска)
	
	ДГ.Очистить();

    ДГ.Обновление = Ложь;
	
	ТЧОтпуска = ТаблицаОтпусков.Выгрузить();
	
	Для Каждого Строка Из ТЧОтпуска Цикл
    
        Точка = ДГ.УстановитьТочку(Строка.Сотрудник);
       // СерияОтпуск =  ДГ.УстановитьСерию("Отпуск");
        //Значение = ДГ.УстановитьТочку(Точка);
        СерияВОтпускеДо28Дней = ДГ.УстановитьСерию("В Отпуске до 28 дней"); 
        
        Значение = ДГ.ПолучитьЗначение(Точка, СерияВОтпускеДо28Дней); 

        Значение.Данные.Сотрудник = Строка.Сотрудник;
       
       //Если отпуск боллее 28 дней интервал окрасить красным
       Если Строка.Больше28дней = Ложь Тогда
        Интервал = Значение.Добавить();
        Интервал.Текст = "Отпуска"; 
        Интервал.Начало = Строка.ДатаНачала;
        Интервал.Конец = Строка.ДатаОкончания;
       Иначе
       	СерияВОтпускеСвыше28Дней = ДГ.УстановитьСерию("В Отпуске более 28 дней");
       	СерияВОтпускеСвыше28Дней.Цвет =  WebЦвета.Красный;
       	Значение = ДГ.ПолучитьЗначение(Точка, СерияВОтпускеСвыше28Дней ); 
       	Интервал = Значение.Добавить();
        Интервал.Текст = "Отпуска"; 
        Интервал.Начало = Строка.ДатаНачала;
        Интервал.Конец = Строка.ДатаОкончания;
        Интервал.Цвет = WebЦвета.Красный;
       КонецЕсли;
       
        ДГ.ОбластьЗаголовка.Текст = "Отпуска Сотрудников"; 
        ДГ.АвтоОпределениеПолногоИнтервала = Ложь; 
        ДГ.УстановитьПолныйИнтервал(НачалоГода(ГодОтпуска), КонецГода(ГодОтпуска)); 
        
    КонецЦикла;
	ДГ.Обновление = Истина;
КонецПроцедуры

#КонецОбласти



#Область ОБработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    // Проверяем, передан ли адрес из первой формы
    Если Параметры.Свойство("АдресОтпусков") Тогда
        //@skip-check unknown-form-parameter-access
        АдресОтпусков = Параметры.АдресОтпусков;

        // Получаем таблицу значений из временного хранилища
        ТаблицаОтпусков = ПолучитьИзВременногоХранилища(АдресОтпусков);

        // Загружаем данные в табличную часть
        Объект.ОтпускаСотрудников.Загрузить(ТаблицаОтпусков);
    КонецЕсли;
    
    //@skip-check unknown-form-parameter-access
    ГодОтпуска = Параметры.ГодОтпусков;
   // АнализГрафикаОтпусковНаСервере(ДГ,Объект.ОтпускаСотрудников, ГодОтпуска);
    АнализГрафикаОтпусков(ДГ,Объект.ОтпускаСотрудников, ГодОтпуска);

КонецПроцедуры

#КонецОбласти