Процедура ОбработкаПроведения(Отказ, РежимПроведения)

   // Получаем данные из таблицы документа
    ТЧОтпускаСотрудников = ОтпускаСотрудников.Выгрузить();

   

    // Цикл по строкам таблицы
    Для Каждого СтрокаТЧ Из ТЧОтпускаСотрудников Цикл
        // Создаем новую запись в регистре сведений
        Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить(); 
        Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        // Заполняем измерения регистров
        Движение.Сотрудник = СтрокаТЧ.Сотрудник; 
		
		//Рассчитываем количество дней отпуска + 1 день (включительно)
        ДнейОтпускаПлан = (НачалоДня(СтрокаТЧ.ДатаОкончания) - НачалоДня(СтрокаТЧ.ДатаНачала)) / 86400 + 1;

        Движение.ДнейОтпускаПлан = ДнейОтпускаПлан;
                
	КонецЦикла; 
	
	// После заполнения всех записей, сохраняем их
        Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина; 

	КонецПроцедуры