Процедура ОбработкаПроведения(Отказ, РежимПроведения)

   // Получаем данные из таблицы документа
    ТЧОтпускаСотрудников = ОтпускаСотрудников.Выгрузить();

   

    // Цикл по строкам таблицы
    Для Каждого СтрокаТЧ Из ТЧОтпускаСотрудников Цикл
        // Создаем новую запись в регистре сведений
        НоваяЗапись = РегистрыСведений.ВКМ_ГрафикОтпусков.СоздатьМенеджерЗаписи(); 
        НоваяЗапись.Период = НачалоМесяца(ТекущаяДата()); 
        // Заполняем измерения регистров
        НоваяЗапись.Сотрудник = СтрокаТЧ.Сотрудник;
        НоваяЗапись.ДатаНачало = СтрокаТЧ.ДатаНачала;
        НоваяЗапись.ДатаОкончание = СтрокаТЧ.ДатаОкончания;
        // После заполнения всех записей, сохраняем их
        НоваяЗапись.Записать(); 
    КонецЦикла;

	КонецПроцедуры