#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОписаниеПеременных

Процедура СформироватьДвиженияОсновныеНачисления()
	
	Если Начисления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МинимальнаяДатаНачала = Неопределено;
	МаксимальнаяДатаОкончания = Неопределено;
	
	Для Каждого Строка Из Начисления Цикл
		
		Если Строка.ВидРасчетов = ПланыВидовРасчета.ВКМ_ОсновныеНачислени.Оклад Тогда
			Если Не ЗначениеЗаполнено(МинимальнаяДатаНачала)
				Или МинимальнаяДатаНачала > Строка.ДатаНачала Тогда
				МинимальнаяДатаНачала = Строка.ДатаНачала;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(МаксимальнаяДатаОкончания)
				Или МаксимальнаяДатаОкончания < Строка.ДатаОкончания Тогда
				МаксимальнаяДатаОкончания = Строка.ДатаОкончания;
			КонецЕсли;		
		КонецЕсли;    
		
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
	               |	НачислениеЗарплатыНачисления.ВидРасчетов КАК ВидРасчета,
	               |	НачислениеЗарплатыНачисления.ДатаНачала КАК ДатаНачала,
	               |	НачислениеЗарплатыНачисления.ДатаОкончания КАК ДатаОкончания,
	               |	НачислениеЗарплатыНачисления.ГрафикРаботы КАК ГрафикРаботы
	               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	               |ИЗ
	               |	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК НачислениеЗарплатыНачисления
	               |ГДЕ
	               |	НачислениеЗарплатыНачисления.Ссылка = &Ссылка
	               |	И НачислениеЗарплатыНачисления.ВидРасчетов В (ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачислени.Оклад), ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачислени.Отпуск))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СведенияОСотрудникахСрезПоследних.Период КАК Период,
	               |	СведенияОСотрудникахСрезПоследних.Сотрудник КАК Сотрудник,
	               |	СведенияОСотрудникахСрезПоследних.Оклад КАК Оклад
	               |ПОМЕСТИТЬ ВТ_ИсторияОклада
	               |ИЗ
	               |	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	               |			&МинимальнаяДатаНачала,
	               |			Сотрудник В
	               |				(ВЫБРАТЬ
	               |					ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник
	               |				ИЗ
	               |					ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК СведенияОСотрудникахСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СведенияОСотрудниках.Период,
	               |	СведенияОСотрудниках.Сотрудник,
	               |	СведенияОСотрудниках.Оклад
	               |ИЗ
	               |	РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК СведенияОСотрудниках
	               |ГДЕ
	               |	СведенияОСотрудниках.Период > &МинимальнаяДатаНачала
	               |	И СведенияОСотрудниках.Период < &МаксимальнаяДатаОкончания
	               |	И СведенияОСотрудниках.Сотрудник В
	               |			(ВЫБРАТЬ
	               |				ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник
	               |			ИЗ
	               |				ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТекущаяЗапись.Период КАК ДатаНачала,
	               |	ТекущаяЗапись.Сотрудник КАК Сотрудник,
	               |	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(МИНИМУМ(СледующаяЗапись.Период), ДЕНЬ, -1), ДАТАВРЕМЯ(3999, 12, 21)) КАК ДатаОкончания
	               |ПОМЕСТИТЬ ВТ_Интервалы
	               |ИЗ
	               |	ВТ_ИсторияОклада КАК ТекущаяЗапись
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияОклада КАК СледующаяЗапись
	               |		ПО ТекущаяЗапись.Сотрудник = СледующаяЗапись.Сотрудник
	               |			И ТекущаяЗапись.Период < СледующаяЗапись.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТекущаяЗапись.Сотрудник,
	               |	ТекущаяЗапись.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Интервалы.Сотрудник КАК Сотрудник,
	               |	ВТ_ИсторияОклада.Оклад КАК Оклад,
	               |	ВТ_Интервалы.ДатаНачала КАК ДатаНачала,
	               |	ВТ_Интервалы.ДатаОкончания КАК ДатаОкончания
	               |ПОМЕСТИТЬ ВТ_ИнтервалыОклада
	               |ИЗ
	               |	ВТ_Интервалы КАК ВТ_Интервалы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияОклада КАК ВТ_ИсторияОклада
	               |		ПО ВТ_Интервалы.Сотрудник = ВТ_ИсторияОклада.Сотрудник
	               |			И ВТ_Интервалы.ДатаНачала = ВТ_ИсторияОклада.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник,
	               |	ВТ_ДанныеДокумента.ВидРасчета КАК ВидРасчета,
	               |	ВЫБОР
	               |		КОГДА ВТ_ДанныеДокумента.ДатаНачала < ВТ_ИнтервалыОклада.ДатаНачала
	               |			ТОГДА ВТ_ИнтервалыОклада.ДатаНачала
	               |		ИНАЧЕ ВТ_ДанныеДокумента.ДатаНачала
	               |	КОНЕЦ КАК ПериодДействияНачало,
	               |	ВЫБОР
	               |		КОГДА ВТ_ДанныеДокумента.ДатаОкончания > ВТ_ИнтервалыОклада.ДатаОкончания
	               |			ТОГДА ВТ_ИнтервалыОклада.ДатаОкончания
	               |		ИНАЧЕ ВТ_ДанныеДокумента.ДатаОкончания
	               |	КОНЕЦ КАК ПериодДействияКонец,
	               |	ВТ_ДанныеДокумента.ГрафикРаботы КАК ГрафикРаботы,
	               |	ВТ_ИнтервалыОклада.Оклад КАК Показатель
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнтервалыОклада КАК ВТ_ИнтервалыОклада
	               |		ПО ВТ_ДанныеДокумента.Сотрудник = ВТ_ИнтервалыОклада.Сотрудник
	               |			И ВТ_ДанныеДокумента.ДатаНачала <= ВТ_ИнтервалыОклада.ДатаОкончания
	               |			И ВТ_ДанныеДокумента.ДатаОкончания >= ВТ_ИнтервалыОклада.ДатаНачала
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НачислениеЗарплатыНачисления.Сотрудник,
	               |	НачислениеЗарплатыНачисления.ВидРасчетов,
	               |	НачислениеЗарплатыНачисления.ДатаНачала,
	               |	НачислениеЗарплатыНачисления.ДатаОкончания,
	               |	НачислениеЗарплатыНачисления.ГрафикРаботы,
	               |	NULL
	               |ИЗ
	               |	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК НачислениеЗарплатыНачисления
	               |ГДЕ
	               |	НачислениеЗарплатыНачисления.Ссылка = &Ссылка
	               |	И НачислениеЗарплатыНачисления.ВидРасчетов ССЫЛКА ПланВидовРасчета.ВКМ_ОсновныеНачислени
	               |	И НачислениеЗарплатыНачисления.ВидРасчетов <> ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачислени.Оклад)
	               |	И НачислениеЗарплатыНачисления.ВидРасчетов <> ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачислени.Отпуск)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МинимальнаяДатаНачала", МинимальнаяДатаНачала);
	Запрос.УстановитьПараметр("МаксимальнаяДатаОкончания", МаксимальнаяДатаОкончания);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
		//Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачислени.Отпуск Тогда
		//	Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Движение.ПериодДействияНачало, -2));
		//	Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Движение.БазовыйПериодНачало, 1));
		//	Движение.ГрафикРаботы = Справочники.ВКМ_ГрафикРаботы.НайтиПоНаименованию("Пятидневка");
		//КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры



Процедура СформироватьСторноЗаписи()
	
	СторноЗаписи = Движения.ВКМ_ОсновныеНачисления.ПолучитьДополнение();
	
	Для Каждого Запись Из СторноЗаписи Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Запись);
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = Запись.ПериодДействияНачалоСторно;
		Движение.ПериодДействияКонец = Запись.ПериодДействияКонецСторно;
		Движение.СуммаНачисления = 0;
		Движение.ЧасовОтработано = 0;
		Движение.Сторно = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РасчитатьОклад()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	               |	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК План,
	               |	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
	               |			ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачислени.Оклад)
	               |				И Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		Движение.СуммаНачисления = Движение.Показатель * Выборка.Факт / Выборка.План;
		Движение.ЧасовОтработано = Выборка.Факт;
		
		Если Движение.Сторно Тогда
			Движение.СуммаНачисления = - Движение.СуммаНачисления;
			Движение.ЧасовОтработано = - Движение.ЧасовОтработано;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры

Процедура РассчитатьОтпуск()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	               |	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК План,
	               |	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
	               |			ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачислени.Отпуск)
	               |				И Регистратор = &Ссылка) КАК ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		Движение.СуммаНачисления = Движение.Показатель * Выборка.Факт * 2 / Выборка.План / 3;
		Движение.ЧасовОтработано = Выборка.Факт;
		
		Если Движение.Сторно  Тогда
			Движение.СуммаНачисления = - Движение.СуммаНачисления;
			Движение.ЧасовОтработано = - Движение.ЧасовОтработано;
		
		КонецЕсли;
		
		//(Начисленная сумма за 12 мес. / Количество рабочих дней) х Количество календарных дней отпуска
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
	
КонецПроцедуры

Процедура РассчитатьНДФЛ()

    //Рассчитываем НДФЛ в процедуре проведения документа

    НДФЛ = 0.13;
    
    //Движения.ВКМ_ДополнительныеНачисления.Очистить();
    
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
                   |	ВКМ_ОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
                   |	СУММА(ВКМ_ОсновныеНачисления.СуммаНачисления) КАК СуммаНачисления
                   |ИЗ
                   |	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
                   |ГДЕ
                   |	ВКМ_ОсновныеНачисления.Регистратор = &Регистратор
                   |	И ВКМ_ОсновныеНачисления.Сторно = ЛОЖЬ
                   |
                   |СГРУППИРОВАТЬ ПО
                   |	ВКМ_ОсновныеНачисления.ПериодРегистрации,
                   |	ВКМ_ОсновныеНачисления.Сотрудник";
    
    Запрос.УстановитьПараметр("Регистратор", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
    
            НовоеДвижениеУдержания  = Движения.ВКМ_Удержания.Добавить();
            НовоеДвижениеУдержания.ПериодРегистрации  = Выборка.ПериодРегистрации;
            НовоеДвижениеУдержания.Сотрудник  = Выборка.Сотрудник;
            НовоеДвижениеУдержания.ВидРасчета  = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
            НовоеДвижениеУдержания.Сумма        =  Выборка.СуммаНачисления*НДФЛ; 
		    
		КонецЦикла; 
		
		Движения.ВКМ_Удержания.Записать();
			     
КонецПроцедуры

Процедура СформироватьДвиженияПоРегиструВзаиморасчетыССотрудниками()
	
       // 1. Собираем уникальный список сотрудников из табличной части
    ТЧНачисления = Начисления.Выгрузить();  

    Сотрудники = Новый Массив;

    Для Каждого СтрокаТЧ Из ТЧНачисления Цикл
        Сотрудники.Добавить(СтрокаТЧ.Сотрудник );
    КонецЦикла;


    // 2. Единый запрос для получения сумм начислений и удержаний по сотрудникам
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	СУММА(ВКМ_ОсновныеНачисления.СуммаНачисления) КАК СуммаНачисления,
    |	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник
    |ПОМЕСТИТЬ ВТ_Начисления
    |ИЗ
    |	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
    |ГДЕ
    |	ВКМ_ОсновныеНачисления.Сотрудник В(&СписокСотрудников)
    |	И ВКМ_ОсновныеНачисления.Регистратор = &Регистратор
    |	И ВКМ_ОсновныеНачисления.Сторно = ЛОЖЬ
    |
    |СГРУППИРОВАТЬ ПО
    |	ВКМ_ОсновныеНачисления.Сотрудник
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ВТ_Начисления.Сотрудник КАК Сотрудник,
    |	ВТ_Начисления.СуммаНачисления КАК СуммаНачисления,
    |	СУММА(ВКМ_Удержания.Сумма) КАК СуммаУдержания
    |ИЗ
    |	ВТ_Начисления КАК ВТ_Начисления
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
    |		ПО ВТ_Начисления.Сотрудник = ВКМ_Удержания.Сотрудник
    |ГДЕ
    |	ВКМ_Удержания.Регистратор = &Регистратор
    |	И ВТ_Начисления.Сотрудник В(&СписокСотрудников)
    |
    |СГРУППИРОВАТЬ ПО
    |	ВТ_Начисления.Сотрудник,
    |	ВТ_Начисления.СуммаНачисления";

    Запрос.УстановитьПараметр("СписокСотрудников", Сотрудники);
    Запрос.УстановитьПараметр("Регистратор", Ссылка);

    РезультатЗапроса = Запрос.Выполнить();

    // 3. Обрабатываем результаты запроса и записываем движения взаиморасчетов
    Если Не РезультатЗапроса.Пустой() Тогда
        Выборка = РезультатЗапроса.Выбрать();

        Пока Выборка.Следующий() Цикл
            ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
            ДвижениеВзаиморасчеты.Период = Дата;
            ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
            ДвижениеВзаиморасчеты.Регистратор = Ссылка; // или используйте документ-основание, если есть
            ДвижениеВзаиморасчеты.Сотрудник = Выборка.Сотрудник;
            ДвижениеВзаиморасчеты.Сумма = Выборка.СуммаНачисления - Выборка.СуммаУдержания;
        КонецЦикла;

        Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	КонецЕсли; 
	
КонецПроцедуры

Процедура СформироватьДвижениеОтпуск()
	
	// Получаем данные из таблицы документа
    ТЧОтпускаСотрудников = Начисления.Выгрузить();

   

    // Цикл по строкам таблицы
    Для Каждого СтрокаТЧ Из ТЧОтпускаСотрудников Цикл
        // Создаем новую запись в регистре сведений
        Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить(); 
        Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        // Заполняем измерения регистров
        Движение.Сотрудник = СтрокаТЧ.Сотрудник; 
		
		//Рассчитываем количество дней отпуска + 1 день (включительно)
        ДнейОтпускаФакт = (НачалоДня(СтрокаТЧ.ДатаОкончания) - НачалоДня(СтрокаТЧ.ДатаНачала)) / 86400 + 1;

        Движение.ДнейОтпускаФакт = ДнейОтпускаФакт;
                
	КонецЦикла; 
	
	// После заполнения всех записей, сохраняем их
        Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвиженияОсновныеНачисления();
	
	СформироватьСторноЗаписи();
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
	
	РасчитатьОклад();
	
	РассчитатьОтпуск();
	
	РассчитатьНДФЛ();
	
	СформироватьДвиженияПоРегиструВзаиморасчетыССотрудниками();	 
	
	СформироватьДвижениеОтпуск();
КонецПроцедуры

#КонецОбласти
#КонецЕсли

