
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
    УправлениеВидимостьюДополнительныхРеквизитов();
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюДополнительныхРеквизитов()

    Если Объект.ВидДоговора = Неопределено Тогда
    	
    Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость               = Ложь;
    Элементы.ВКМ_ДатаОкончанияДействияДогвора.Видимость              = Ложь;
    Элементы.ВКМ_СуммаЕжемесячнойАбонентскойПлаты.Видимость          = Ложь;
    Элементы.ВКМ_СтоимостьЧасасРаботыСпециалиста.Видимость             = Ложь;
    
    ИначеЕсли Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда

    Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость               = Истина;
    Элементы.ВКМ_ДатаОкончанияДействияДогвора.Видимость              = Истина;
    Элементы.ВКМ_СуммаЕжемесячнойАбонентскойПлаты.Видимость          = Истина;
    Элементы.ВКМ_СтоимостьЧасасРаботыСпециалиста.Видимость             = Истина;
    
    Иначе
    Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость               = Ложь;
    Элементы.ВКМ_ДатаОкончанияДействияДогвора.Видимость              = Ложь;
    Элементы.ВКМ_СуммаЕжемесячнойАбонентскойПлаты.Видимость          = Ложь;
    Элементы.ВКМ_СтоимостьЧасасРаботыСпециалиста.Видимость             = Ложь;
    КонецЕсли;

КонецПроцедуры