#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	СоздатьРеализацию = Ложь;
	ДлительнаяОперация = ВыполнениеНаСервере(СоздатьРеализацию);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении",ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,ОповещениеОЗавершении ,ПараметрыОжидания );
	
КонецПроцедуры

&НаКлиенте
Процедура СоздаттьРеализацию(Команда)
	СоздатьРеализацию = Истина;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ДлительнаяОперация = ВыполнениеНаСервере(СоздатьРеализацию);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении",ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,ОповещениеОЗавершении ,ПараметрыОжидания );
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыполнениеНаСервере(СоздатьРеализацию)
	 
	 ДлительнаяОперация =  ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.СозданиеСпискаНаСервере", Объект.Период, СоздатьРеализацию);
	 Возврат ДлительнаяОперация;
КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершении (Результат, ДопонительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда

		МассивРеализаций = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		ЗаполнитьДоговоры(МассивРеализаций);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДоговоры(МассивРеализаций)
	
	Объект.Список.Очистить();

	Для Каждого Документ Из МассивРеализаций Цикл
		НоваяСтрока = Объект.Список.Добавить();
		НоваяСтрока.Договор = Документ.Договор;
		НоваяСтрока.СсылкаНаРеализацию = Документ.Реализация;
		КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

